src/Catalogs/ДоступКСпискамИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ДоступКСпискамИнформационныхБаз</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПризнакИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликацияВебСервиса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПубликацииВебСервисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСпискиОбщихИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписокОбщихИБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпискиИнформационныхБаз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ДоступКСпискамИнформационныхБаз/Ext/ObjectModule.bsl
//
//
Процедура ПередЗаписью(Отказ)
	
	ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Наименование);
	ЭтотОбъект.ПризнакИзменения = СокрЛП(Новый УникальныйИдентификатор);
	ЭтотОбъект.ClientID = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Наименование).УникальныйИдентификатор;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоступКСпискамИнформационныхБаз.Ссылка
		|ИЗ
		|	Справочник.ДоступКСпискамИнформационныхБаз КАК ДоступКСпискамИнформационныхБаз
		|ГДЕ
		|	ДоступКСпискамИнформационныхБаз.ClientID = &ClientID";	
	Запрос.УстановитьПараметр("ClientID", ЭтотОбъект.ClientID);
	Если НЕ ЭтоНовый() Тогда 
		Запрос.Текст = Запрос.Текст +  " И ДоступКСпискамИнформационныхБаз.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();		
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияСервер.ВывестиСообщение("Доступ для пользователя <" + СокрЛП(ЭтотОбъект.Наименование) + "> уже определен!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
